In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [6]:
data = pd.read_csv("Position_Salaries.csv")
data.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

In [26]:
X = data.iloc[:, 1:-1]
y = pd.DataFrame(data.Salary)

In [27]:
X.head()

   Level
0      1
1      2
2      3
3      4
4      5

In [28]:
y.head()

   Salary
0   45000
1   50000
2   60000
3   80000
4  110000

In [29]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)